// Urdu Grammar Quiz
final List<Map<String, dynamic>> urduQuestions = [
  {
    "question": "اسم کس کو کہتے ہیں؟",
    "options": ["کام", "خوبصورت", "کتاب", "جلدی"],
    "answer": 2,
  },
  {
    "question": "فعل کس کو کہتے ہیں؟",
    "options": ["سیب", "کھانا", "سبز", "آہستہ"],
    "answer": 1,
  },
  {
    "question": "صفت کس کو کہتے ہیں؟",
    "options": ["تیز", "کتا", "گانا", "جلدی"],
    "answer": 0,
  },
  {
    "question": "حال کس کو کہتے ہیں؟",
    "options": ["خوش", "آہستہ آہستہ", "گھر", "کھیلنا"],
    "answer": 1,
  },
  {
    "question": "ضمیر کی مثال کون سی ہے؟",
    "options": ["کتاب", "وہ", "باغ", "خوبصورت"],
    "answer": 1,
  },
  {
    "question": "حرفِ جار کی مثال کون سی ہے؟",
    "options": ["میں", "خوبصورتی", "کھیلنا", "کتاب"],
    "answer": 0,
  },
  {
    "question": "جملہ اسمیہ کس کو کہتے ہیں؟",
    "options": [
      "جملہ جس میں فعل نہ ہو",
      "جملہ جس میں فعل ہو",
      "جملہ جس میں حال ہو",
      "جملہ جس میں سوال ہو",
    ],
    "answer": 0,
  },
  {
    "question": "جملہ فعلیہ کس کو کہتے ہیں؟",
    "options": [
      "جملہ جس میں اسم ہو",
      "جملہ جس میں فعل ہو",
      "جملہ جو سوال کرے",
      "جملہ جو حال بیان کرے",
    ],
    "answer": 1,
  },
  {
    "question": "سوالیہ جملہ کس کو کہتے ہیں؟",
    "options": [
      "جملہ جو بیان دے",
      "جملہ جو حکم دے",
      "جملہ جو سوال کرے",
      "جملہ جو خوشی ظاہر کرے",
    ],
    "answer": 2,
  },
  {
    "question": "فعلِ ماضی کی مثال کون سی ہے؟",
    "options": [
      "میں کھاؤں گا",
      "وہ کھاتا ہے",
      "میں نے کھایا",
      "وہ کھیل رہا ہے",
    ],
    "answer": 2,
  },
  {
    "question": "فعلِ حال کی مثال کون سی ہے؟",
    "options": ["وہ دوڑا", "وہ دوڑ رہا ہے", "وہ دوڑے گا", "میں نے دوڑا"],
    "answer": 1,
  },
  {
    "question": "فعلِ مستقبل کی مثال کون سی ہے؟",
    "options": [
      "میں کھیل رہا ہوں",
      "میں نے کھیلا",
      "میں کھیلوں گا",
      "میں کھیلتا ہوں",
    ],
    "answer": 2,
  },
  {
    "question": "حرفِ عطف کی مثال کون سی ہے؟",
    "options": ["اور", "کتاب", "دوڑ", "خوبصورت"],
    "answer": 0,
  },
  {
    "question": "امر کی مثال کون سی ہے؟",
    "options": ["جاؤ", "میں گیا", "وہ جا رہا ہے", "وہ جائے گا"],
    "answer": 0,
  },
  {
    "question": "نہی کی مثال کون سی ہے؟",
    "options": ["مت جاؤ", "میں گیا", "وہ جا رہا ہے", "وہ جائے گا"],
    "answer": 0,
  },
  {
    "question": "حرفِ ندا کی مثال کون سی ہے؟",
    "options": ["اے دوست", "خوبصورت", "کتاب", "کھیل"],
    "answer": 0,
  },
  {
    "question": "مترادف الفاظ کی مثال کون سی ہے؟",
    "options": ["دوڑ، بھاگ", "کتاب، قلم", "خوبصورت، بدصورت", "گھر، بازار"],
    "answer": 0,
  },
  {
    "question": "متضاد الفاظ کی مثال کون سی ہے؟",
    "options": ["اندھیرا، روشنی", "کتاب، قلم", "دوڑ، بھاگ", "خوشبو، مہک"],
    "answer": 0,
  },
  {
    "question": "جمع کی مثال کون سی ہے؟",
    "options": ["کتابیں", "کتاب", "دوڑ", "کھیل"],
    "answer": 0,
  },
  {
    "question": "واحد کی مثال کون سی ہے؟",
    "options": ["کتاب", "کتابیں", "بچے", "دوڑیں"],
    "answer": 0,
  },
];
